## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/65142312/runs/fa66eab1-d9f9-4deb-87e2-092029220d8f).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
```diff

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # aws_cloudwatch_log_group.yada will be created
+   resource "aws_cloudwatch_log_group" "yada" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "Yada"
+       name_prefix       = (known after apply)
+       retention_in_days = 0
+       skip_destroy      = false
+       tags              = {
+           "Application" = "serviceA"
+           "Environment" = "production"
        }
+       tags_all          = {
+           "3ware:managed-by-terraform" = "true"
+           "3ware:project-id"           = "bootstrap-test"
+           "Application"                = "serviceA"
+           "Environment"                = "production"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
